1s/ERP/extensions/liko/Documents/Лико_ЗаказОснастки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_ЗаказОснастки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Оснастка</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Этикетки</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/extensions/liko/Documents/Лико_ЗаказОснастки/Ext/ObjectModule.bsl
//&Вместо("ОбработкаЗаполнения")
Процедура Лико_ОбработкаЗаполнения22(ДанныеЗаполнения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Заказ = ДанныеЗаполнения;	
	//ИначеЕсли  ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.СпецификацииНоменклатуры") Тогда
	//	ЗаполнитьПоСпецификации(ДанныеЗаполнения,1);
	//ИначеЕсли  ТипЗнч(ДанныеЗаполнения) = Тип("Структура")  Тогда
	//	Если ДанныеЗаполнения.Свойство("Заказ") Тогда 
			// Заполнение шапки
			Ответственный = Пользователи.ТекущийПользователь();
			Площадка = Заказ.Площадка;
			//ВидОперации = Перечисления.Лико_ВидыОперацийЗаказОснастки.Перезаказ;
			//ЗаказНового = Ложь;
			ЗапросНом =Новый Запрос;
			ЗапросНом.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаказПокупателяТовары.Номенклатура
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ЗаказПокупателяТовары
			|ГДЕ
			|	ЗаказПокупателяТовары.Ссылка = &Заказ";
			ЗапросНом.УстановитьПараметр("Заказ", Заказ);
			ТЗНом = ЗапросНом.Выполнить().Выгрузить();
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаЦвета.НомерСтроки) КАК КоличествоЦветов,
			|	ЗаказКлиентаЦвета.Ссылка КАК Заказ
			|ПОМЕСТИТЬ ТабЦветов
			|ИЗ
			|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
			|ГДЕ
			|	ЗаказКлиентаЦвета.Ссылка = &Заказ
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказКлиентаЦвета.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаказКлиентаВидыРабот.ВидРабот КАК ВидРабот,
			|	ЗаказКлиентаВидыРабот.РабочийЦентр КАК РабочийЦентр,
			|	ЗаказКлиентаВидыРабот.Оснастка КАК Номенклатура,
			|	ЗаказКлиентаВидыРабот.ЗаказНовойОснастки КАК ЗаказНовойОснастки,
			|	ЗаказКлиентаВидыРабот.Ссылка.ОсновнойМатериал КАК Материал,
			|	ЗаказКлиентаВидыРабот.Ссылка.Партнер КАК Партнер,
			|	ЗаказКлиентаВидыРабот.Ссылка.ОсновнойМатериал КАК ОсновнойМатериал,
			|	ЗаказКлиентаВидыРабот.Ссылка.МетражПМ КАК МетражПМ,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Нарезка
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ЗаказКлиентаВидыРабот.Нарезка <> ЗНАЧЕНИЕ(Справочник.Яссм_Нарезки.ПустаяСсылка)
			|					ТОГДА ЗаказКлиентаВидыРабот.Нарезка
			|				ИНАЧЕ Лико_ПараметрыШтампа.Нарезка
			|			КОНЕЦ
			|	КОНЕЦ КАК Нарезка,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ЭтикетокНаЛисте
			|		ИНАЧЕ Лико_ПараметрыШтампа.ЭтикетокНаЛисте
			|	КОНЕЦ КАК ЭтикетокНаЛисте,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ШагПечати
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ЗаказКлиентаВидыРабот.Дополнительно <> 0
			|					ТОГДА ЗаказКлиентаВидыРабот.Дополнительно
			|				ИНАЧЕ Лико_ПараметрыШтампа.ШагПечати
			|			КОНЕЦ
			|	КОНЕЦ КАК ШагПечати,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Ручьи
			|		ИНАЧЕ Лико_ПараметрыШтампа.Ручьи
			|	КОНЕЦ КАК Ручьи,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ДлинаЭтикетки
			|		ИНАЧЕ Лико_ПараметрыШтампа.ДлинаЭтикетки
			|	КОНЕЦ КАК ДлинаЭтикетки,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ШиринаЭтикетки
			|		ИНАЧЕ Лико_ПараметрыШтампа.ШиринаЭтикетки
			|	КОНЕЦ КАК ШиринаЭтикетки,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Z
			|		ИНАЧЕ Лико_ПараметрыШтампа.Z
			|	КОНЕЦ КАК Z,
			|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями КАК ИнтервалМеждуРучьями,
			|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками КАК ИнтервалМеждуЭтикетками,
			|	ЗаказКлиентаВидыРабот.Ссылка.Менеджер КАК Менеджер,
			|	ТабЦветов.КоличествоЦветов КАК КоличествоЦветов,
			|	ЗаказКлиентаВидыРабот.Ссылка КАК Заказ,
			|	ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра КАК ВидРЦ,
			|	ЗаказКлиентаВидыРабот.Ссылка.Тираж КАК Тираж
			|ИЗ
			|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
			|		ПО ЗаказКлиентаВидыРабот.Оснастка = Лико_ПараметрыШтампа.Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЦветов КАК ТабЦветов
			|		ПО ЗаказКлиентаВидыРабот.Ссылка = ТабЦветов.Заказ
			|ГДЕ
			|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
			|	И (ЗаказКлиентаВидыРабот.Оснастка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ИЛИ ЗаказКлиентаВидыРабот.ЗаказНовойОснастки = ИСТИНА)";
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаЦвета.НомерСтроки) КАК КоличествоЦветов,
			|	ЗаказКлиентаЦвета.Ссылка КАК Заказ
			|ПОМЕСТИТЬ ТабЦветов
			|ИЗ
			|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
			|ГДЕ
			|	ЗаказКлиентаЦвета.Ссылка = &Заказ
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказКлиентаЦвета.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаказКлиентаВидыРабот.ВидРабот КАК ВидРабот,
			|	ЗаказКлиентаВидыРабот.РабочийЦентр КАК РабочийЦентр,
			|	ЗаказКлиентаВидыРабот.Оснастка КАК Номенклатура,
			|	ЗаказКлиентаВидыРабот.ЗаказНовойОснастки КАК ЗаказНовойОснастки,
			|	ЗаказКлиентаВидыРабот.Ссылка.ОсновнойМатериал КАК Материал,
			|	ЗаказКлиентаВидыРабот.Ссылка.Партнер КАК Партнер,
			|	ЗаказКлиентаВидыРабот.Ссылка.ОсновнойМатериал КАК ОсновнойМатериал,
			|	ЗаказКлиентаВидыРабот.Ссылка.МетражПМ КАК МетражПМ,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Нарезка
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ЗаказКлиентаВидыРабот.Нарезка <> ЗНАЧЕНИЕ(Справочник.Яссм_Нарезки.ПустаяСсылка)
			|					ТОГДА ЗаказКлиентаВидыРабот.Нарезка
			|				ИНАЧЕ Лико_ПараметрыШтампа.Нарезка
			|			КОНЕЦ
			|	КОНЕЦ КАК Нарезка,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ЭтикетокНаЛисте
			|		ИНАЧЕ Лико_ПараметрыШтампа.ЭтикетокНаЛисте
			|	КОНЕЦ КАК ЭтикетокНаЛисте,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ШагПечати
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ЗаказКлиентаВидыРабот.Дополнительно <> 0
			|					ТОГДА ЗаказКлиентаВидыРабот.Дополнительно
			|				ИНАЧЕ Лико_ПараметрыШтампа.ШагПечати
			|			КОНЕЦ
			|	КОНЕЦ КАК ШагПечати,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Ручьи
			|		ИНАЧЕ Лико_ПараметрыШтампа.Ручьи
			|	КОНЕЦ КАК Ручьи,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ДлинаЭтикетки
			|		ИНАЧЕ Лико_ПараметрыШтампа.ДлинаЭтикетки
			|	КОНЕЦ КАК ДлинаЭтикетки,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ШиринаЭтикетки
			|		ИНАЧЕ Лико_ПараметрыШтампа.ШиринаЭтикетки
			|	КОНЕЦ КАК ШиринаЭтикетки,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Z
			|		ИНАЧЕ Лико_ПараметрыШтампа.Z
			|	КОНЕЦ КАК Z,
			|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями КАК ИнтервалМеждуРучьями,
			|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками КАК ИнтервалМеждуЭтикетками,
			|	ЗаказКлиентаВидыРабот.Ссылка.Менеджер КАК Менеджер,
			|	ТабЦветов.КоличествоЦветов КАК КоличествоЦветов,
			|	ЗаказКлиентаВидыРабот.Ссылка КАК Заказ,
			|	ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра КАК ВидРЦ,
			|	ЗаказКлиентаВидыРабот.Ссылка.Тираж КАК Тираж,
			|	ЗаказКлиентаВидыРабот.Ссылка.Регион КАК Регион
			|ИЗ
			|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
			|		ПО ЗаказКлиентаВидыРабот.Оснастка = Лико_ПараметрыШтампа.Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЦветов КАК ТабЦветов
			|		ПО ЗаказКлиентаВидыРабот.Ссылка = ТабЦветов.Заказ
			|ГДЕ
			|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
			|	И (ЗаказКлиентаВидыРабот.Оснастка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ИЛИ ЗаказКлиентаВидыРабот.ЗаказНовойОснастки = ИСТИНА)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗаказКлиентаВидыРабот.ВидРабот,
			|	ЗаказКлиентаВидыРабот.РабочийЦентр,
			|	Ном.Ссылка,
			|	ЗаказКлиентаВидыРабот.ЗаказНовойОснастки,
			|	ЗаказКлиентаВидыРабот.Ссылка.ОсновнойМатериал,
			|	ЗаказКлиентаВидыРабот.Ссылка.Партнер,
			|	ЗаказКлиентаВидыРабот.Ссылка.ОсновнойМатериал,
			|	ЗаказКлиентаВидыРабот.Ссылка.МетражПМ,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Нарезка
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ЗаказКлиентаВидыРабот.Нарезка <> ЗНАЧЕНИЕ(Справочник.Яссм_Нарезки.ПустаяСсылка)
			|					ТОГДА ЗаказКлиентаВидыРабот.Нарезка
			|				ИНАЧЕ Лико_ПараметрыШтампа.Нарезка
			|			КОНЕЦ
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ЭтикетокНаЛисте
			|		ИНАЧЕ Лико_ПараметрыШтампа.ЭтикетокНаЛисте
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ШагПечати
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ЗаказКлиентаВидыРабот.Дополнительно <> 0
			|					ТОГДА ЗаказКлиентаВидыРабот.Дополнительно
			|				ИНАЧЕ Лико_ПараметрыШтампа.ШагПечати
			|			КОНЕЦ
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Ручьи
			|		ИНАЧЕ Лико_ПараметрыШтампа.Ручьи
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ДлинаЭтикетки
			|		ИНАЧЕ Лико_ПараметрыШтампа.ДлинаЭтикетки
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ШиринаЭтикетки
			|		ИНАЧЕ Лико_ПараметрыШтампа.ШиринаЭтикетки
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
			|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Z
			|		ИНАЧЕ Лико_ПараметрыШтампа.Z
			|	КОНЕЦ,
			|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями,
			|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками,
			|	ЗаказКлиентаВидыРабот.Ссылка.Менеджер,
			|	ТабЦветов.КоличествоЦветов,
			|	ЗаказКлиентаВидыРабот.Ссылка,
			|	ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра,
			|	ЗаказКлиентаВидыРабот.Ссылка.Тираж,
			|	ЗаказКлиентаВидыРабот.Ссылка.Регион
			|ИЗ
			|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЦветов КАК ТабЦветов
			|		ПО ЗаказКлиентаВидыРабот.Ссылка = ТабЦветов.Заказ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
			|			ПО Ном.Ссылка = Лико_ПараметрыШтампа.Номенклатура
			|		ПО ЗаказКлиентаВидыРабот.Оснастка.Артикул = Ном.Артикул
			|			И (ЗаказКлиентаВидыРабот.Оснастка.Артикул = Ном.Артикул)
			|			И (Ном.Наименование ПОДОБНО ""%Контрматрица%"")
			|ГДЕ
			|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
			|	И (ЗаказКлиентаВидыРабот.Оснастка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ИЛИ ЗаказКлиентаВидыРабот.ЗаказНовойОснастки = ИСТИНА)";
			

			
			Запрос.УстановитьПараметр("Заказ", Заказ);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				стр = Оснастка.Добавить();
				стр.Статус = Перечисления.Лико_СтатусыЗаказовНаОснастку.Создан;
				ЗаполнитьЗначенияСвойств(стр, Выборка);
				стр.количество = 1;
				стр.ВидШтампа = Выборка.ВидРабот;
				КлючСтроки = Новый УникальныйИдентификатор;
				стр.ключстроки = КлючСтроки;
				Для каждого стрНом Из ТЗНом Цикл
					стрЭт = Этикетки.Добавить();
					стрЭт.Этикетка = СтрНом.Номенклатура;
					стрЭт.КлючСтроки = стр.ключСтроки;
				КонецЦикла;
				
				Если Выборка.ЗаказНовойОснастки Тогда 
					ВидОперации = Перечисления.Лико_ВидыОперацийЗаказОснастки.Новый;
				ИначеЕсли ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
					ВидОперации = Перечисления.Лико_ВидыОперацийЗаказОснастки.Перезаказ;
				КонецЕсли;
				
				Если Выборка.Количество()>1 Тогда
					ВидОперации = Перечисления.Лико_ВидыОперацийЗаказОснастки.Перезаказ;
				КонецЕсли;
			КонецЦикла;	
		//ИначеЕсли  ДанныеЗаполнения.Свойство("Спецификация")  И ДанныеЗаполнения.Свойство("НомерВарианта") Тогда 
		//	ЗаполнитьПоСпецификации(ДанныеЗаполнения.Спецификация,ДанныеЗаполнения.НомерВарианта);
		//	
		//КонецЕсли;	
	КонецЕсли;
		
КонецПроцедуры
